kEps/kEps_config1/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0340; 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0340;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            epsilonWallFunction;
        value           uniform 0.0340;
    }
    lowerWall
    {
        type            epsilonWallFunction;
        value           uniform 0.0340;
    }
    frontAndBackWall
    {
        type            empty;
    }
    sideWall
    {
        type            epsilonWallFunction;
        value           uniform 0.0340;
    }
}


// ************************************************************************* //
